RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32tg110f32.h
/** Grouped by channel c, function f */
#define AF_PORT(c, f)    (                    \
    (c) == 0 ? AF_CMU_CLK0_PORT((f)) :        \
    (c) == 1 ? AF_CMU_CLK1_PORT((f)) :        \
    (c) == 2 ? AF_LESENSE_CH0_PORT((f)) :     \
    (c) == 3 ? AF_LESENSE_CH1_PORT((f)) :     \
    (c) == 4 ? AF_LESENSE_CH2_PORT((f)) :     \
    (c) == 5 ? AF_LESENSE_CH3_PORT((f)) :     \
    (c) == 6 ? AF_LESENSE_CH4_PORT((f)) :     \
    (c) == 7 ? AF_LESENSE_CH5_PORT((f)) :     \
    (c) == 8 ? AF_LESENSE_CH6_PORT((f)) :     \
    (c) == 9 ? AF_LESENSE_CH7_PORT((f)) :     \
    (c) == 10 ? AF_LESENSE_CH8_PORT((f)) :    \
    (c) == 11 ? AF_LESENSE_CH9_PORT((f)) :    \
    (c) == 12 ? AF_LESENSE_CH10_PORT((f)) :   \
    (c) == 13 ? AF_LESENSE_CH11_PORT((f)) :   \
    (c) == 14 ? AF_LESENSE_CH12_PORT((f)) :   \
    (c) == 15 ? AF_LESENSE_CH13_PORT((f)) :   \
    (c) == 16 ? AF_LESENSE_CH14_PORT((f)) :   \
    (c) == 17 ? AF_LESENSE_CH15_PORT((f)) :   \
    (c) == 18 ? AF_LESENSE_ALTEX0_PORT((f)) : \
    (c) == 19 ? AF_LESENSE_ALTEX1_PORT((f)) : \
    (c) == 20 ? AF_LESENSE_ALTEX2_PORT((f)) : \
    (c) == 21 ? AF_LESENSE_ALTEX3_PORT((f)) : \
    (c) == 22 ? AF_LESENSE_ALTEX4_PORT((f)) : \
    (c) == 23 ? AF_LESENSE_ALTEX5_PORT((f)) : \
    (c) == 24 ? AF_LESENSE_ALTEX6_PORT((f)) : \
    (c) == 25 ? AF_LESENSE_ALTEX7_PORT((f)) : \
    (c) == 26 ? AF_PRS_CH0_PORT((f)) :        \
    (c) == 27 ? AF_PRS_CH1_PORT((f)) :        \
    (c) == 28 ? AF_PRS_CH2_PORT((f)) :        \
    (c) == 29 ? AF_PRS_CH3_PORT((f)) :        \
    (c) == 30 ? AF_TIMER0_CC0_PORT((f)) :     \
    (c) == 31 ? AF_TIMER0_CC1_PORT((f)) :     \
    (c) == 32 ? AF_TIMER0_CC2_PORT((f)) :     \
    (c) == 33 ? AF_TIMER0_CDTI0_PORT((f)) :   \
    (c) == 34 ? AF_TIMER0_CDTI1_PORT((f)) :   \
    (c) == 35 ? AF_TIMER0_CDTI2_PORT((f)) :   \
    (c) == 36 ? AF_TIMER1_CC0_PORT((f)) :     \
    (c) == 37 ? AF_TIMER1_CC1_PORT((f)) :     \
    (c) == 38 ? AF_TIMER1_CC2_PORT((f)) :     \
    (c) == 39 ? AF_TIMER1_CDTI0_PORT((f)) :   \
    (c) == 40 ? AF_TIMER1_CDTI1_PORT((f)) :   \
    (c) == 41 ? AF_TIMER1_CDTI2_PORT((f)) :   \
    (c) == 42 ? AF_USART0_TX_PORT((f)) :      \
    (c) == 43 ? AF_USART0_RX_PORT((f)) :      \
    (c) == 44 ? AF_USART0_CLK_PORT((f)) :     \
    (c) == 45 ? AF_USART0_CS_PORT((f)) :      \
    (c) == 46 ? AF_USART1_TX_PORT((f)) :      \
    (c) == 47 ? AF_USART1_RX_PORT((f)) :      \
    (c) == 48 ? AF_USART1_CLK_PORT((f)) :     \
    (c) == 49 ? AF_USART1_CS_PORT((f)) :      \
    (c) == 50 ? AF_LEUART0_TX_PORT((f)) :     \
    (c) == 51 ? AF_LEUART0_RX_PORT((f)) :     \
    (c) == 52 ? AF_LETIMER0_OUT0_PORT((f)) :  \
    (c) == 53 ? AF_LETIMER0_OUT1_PORT((f)) :  \
    (c) == 54 ? AF_PCNT0_S0IN_PORT((f)) :     \
    (c) == 55 ? AF_PCNT0_S1IN_PORT((f)) :     \
    (c) == 56 ? AF_I2C0_SDA_PORT((f)) :       \
    (c) == 57 ? AF_I2C0_SCL_PORT((f)) :       \
    (c) == 58 ? AF_ACMP0_OUT_PORT((f)) :      \
    (c) == 59 ? AF_ACMP1_OUT_PORT((f)) :      \
    (c) == 60 ? AF_DBG_SWO_PORT((f)) :        \
    (c) == 61 ? AF_DBG_SWDIO_PORT((f)) :      \
    (c) == 62 ? AF_DBG_SWCLK_PORT((f)) :      \
    -1)

#define AF_PIN(c, f)     (                   \
    (c) == 0 ? AF_CMU_CLK0_PIN((f)) :        \
    (c) == 1 ? AF_CMU_CLK1_PIN((f)) :        \
    (c) == 2 ? AF_LESENSE_CH0_PIN((f)) :     \
    (c) == 3 ? AF_LESENSE_CH1_PIN((f)) :     \
    (c) == 4 ? AF_LESENSE_CH2_PIN((f)) :     \
    (c) == 5 ? AF_LESENSE_CH3_PIN((f)) :     \
    (c) == 6 ? AF_LESENSE_CH4_PIN((f)) :     \
    (c) == 7 ? AF_LESENSE_CH5_PIN((f)) :     \
    (c) == 8 ? AF_LESENSE_CH6_PIN((f)) :     \
    (c) == 9 ? AF_LESENSE_CH7_PIN((f)) :     \
    (c) == 10 ? AF_LESENSE_CH8_PIN((f)) :    \
    (c) == 11 ? AF_LESENSE_CH9_PIN((f)) :    \
    (c) == 12 ? AF_LESENSE_CH10_PIN((f)) :   \
    (c) == 13 ? AF_LESENSE_CH11_PIN((f)) :   \
    (c) == 14 ? AF_LESENSE_CH12_PIN((f)) :   \
    (c) == 15 ? AF_LESENSE_CH13_PIN((f)) :   \
    (c) == 16 ? AF_LESENSE_CH14_PIN((f)) :   \
    (c) == 17 ? AF_LESENSE_CH15_PIN((f)) :   \
    (c) == 18 ? AF_LESENSE_ALTEX0_PIN((f)) : \
    (c) == 19 ? AF_LESENSE_ALTEX1_PIN((f)) : \
    (c) == 20 ? AF_LESENSE_ALTEX2_PIN((f)) : \
    (c) == 21 ? AF_LESENSE_ALTEX3_PIN((f)) : \
    (c) == 22 ? AF_LESENSE_ALTEX4_PIN((f)) : \
    (c) == 23 ? AF_LESENSE_ALTEX5_PIN((f)) : \
    (c) == 24 ? AF_LESENSE_ALTEX6_PIN((f)) : \
    (c) == 25 ? AF_LESENSE_ALTEX7_PIN((f)) : \
    (c) == 26 ? AF_PRS_CH0_PIN((f)) :        \
    (c) == 27 ? AF_PRS_CH1_PIN((f)) :        \
    (c) == 28 ? AF_PRS_CH2_PIN((f)) :        \
    (c) == 29 ? AF_PRS_CH3_PIN((f)) :        \
    (c) == 30 ? AF_TIMER0_CC0_PIN((f)) :     \
    (c) == 31 ? AF_TIMER0_CC1_PIN((f)) :     \
    (c) == 32 ? AF_TIMER0_CC2_PIN((f)) :     \
    (c) == 33 ? AF_TIMER0_CDTI0_PIN((f)) :   \
    (c) == 34 ? AF_TIMER0_CDTI1_PIN((f)) :   \
    (c) == 35 ? AF_TIMER0_CDTI2_PIN((f)) :   \
    (c) == 36 ? AF_TIMER1_CC0_PIN((f)) :     \
    (c) == 37 ? AF_TIMER1_CC1_PIN((f)) :     \
    (c) == 38 ? AF_TIMER1_CC2_PIN((f)) :     \
    (c) == 39 ? AF_TIMER1_CDTI0_PIN((f)) :   \
    (c) == 40 ? AF_TIMER1_CDTI1_PIN((f)) :   \
    (c) == 41 ? AF_TIMER1_CDTI2_PIN((f)) :   \
    (c) == 42 ? AF_USART0_TX_PIN((f)) :      \
    (c) == 43 ? AF_USART0_RX_PIN((f)) :      \
    (c) == 44 ? AF_USART0_CLK_PIN((f)) :     \
    (c) == 45 ? AF_USART0_CS_PIN((f)) :      \
    (c) == 46 ? AF_USART1_TX_PIN((f)) :      \
    (c) == 47 ? AF_USART1_RX_PIN((f)) :      \
    (c) == 48 ? AF_USART1_CLK_PIN((f)) :     \
    (c) == 49 ? AF_USART1_CS_PIN((f)) :      \
    (c) == 50 ? AF_LEUART0_TX_PIN((f)) :     \
    (c) == 51 ? AF_LEUART0_RX_PIN((f)) :     \
    (c) == 52 ? AF_LETIMER0_OUT0_PIN((f)) :  \
    (c) == 53 ? AF_LETIMER0_OUT1_PIN((f)) :  \
    (c) == 54 ? AF_PCNT0_S0IN_PIN((f)) :     \
    (c) == 55 ? AF_PCNT0_S1IN_PIN((f)) :     \
    (c) == 56 ? AF_I2C0_SDA_PIN((f)) :       \
    (c) == 57 ? AF_I2C0_SCL_PIN((f)) :       \
    (c) == 58 ? AF_ACMP0_OUT_PIN((f)) :      \
    (c) == 59 ? AF_ACMP1_OUT_PIN((f)) :      \
    (c) == 60 ? AF_DBG_SWO_PIN((f)) :        \
    (c) == 61 ? AF_DBG_SWDIO_PIN((f)) :      \
    (c) == 62 ? AF_DBG_SWCLK_PIN((f)) :      \
    -1)

/** AF channel output count for channel c */
#define AF_COUNT(c)      ( \
    (c) == 0 ? 3 :         \
    (c) == 1 ? 3 :         \
    (c) == 2 ? 1 :         \
    (c) == 3 ? 1 :         \
    (c) == 4 ? 1 :         \
    (c) == 5 ? 1 :         \
    (c) == 6 ? 1 :         \
    (c) == 7 ? 1 :         \
    (c) == 8 ? 1 :         \
    (c) == 9 ? 1 :         \
    (c) == 10 ? 1 :        \
    (c) == 11 ? 1 :        \
    (c) == 12 ? 1 :        \
    (c) == 13 ? 1 :        \
    (c) == 14 ? 1 :        \
    (c) == 15 ? 1 :        \
    (c) == 16 ? 1 :        \
    (c) == 17 ? 1 :        \
    (c) == 18 ? 1 :        \
    (c) == 19 ? 1 :        \
    (c) == 20 ? 1 :        \
    (c) == 21 ? 1 :        \
    (c) == 22 ? 1 :        \
    (c) == 23 ? 1 :        \
    (c) == 24 ? 1 :        \
    (c) == 25 ? 1 :        \
    (c) == 26 ? 2 :        \
    (c) == 27 ? 2 :        \
    (c) == 28 ? 2 :        \
    (c) == 29 ? 2 :        \
    (c) == 30 ? 6 :        \
    (c) == 31 ? 6 :        \
    (c) == 32 ? 6 :        \
    (c) == 33 ? 0 :        \
    (c) == 34 ? 0 :        \
    (c) == 35 ? 0 :        \
    (c) == 36 ? 5 :        \
    (c) == 37 ? 5 :        \
    (c) == 38 ? 5 :        \
    (c) == 39 ? 0 :        \
    (c) == 40 ? 0 :        \
    (c) == 41 ? 0 :        \
    (c) == 42 ? 6 :        \
    (c) == 43 ? 6 :        \
    (c) == 44 ? 6 :        \
    (c) == 45 ? 6 :        \
    (c) == 46 ? 3 :        \
    (c) == 47 ? 3 :        \
    (c) == 48 ? 3 :        \
    (c) == 49 ? 3 :        \
    (c) == 50 ? 5 :        \
    (c) == 51 ? 5 :        \
    (c) == 52 ? 4 :        \
    (c) == 53 ? 4 :        \
    (c) == 54 ? 4 :        \
    (c) == 55 ? 4 :        \
    (c) == 56 ? 7 :        \
    (c) == 57 ? 7 :        \
    (c) == 58 ? 3 :        \
    (c) == 59 ? 3 :        \
    (c) == 60 ? 2 :        \
    (c) == 61 ? 2 :        \
    (c) == 62 ? 2 :        \
    -1)

/** @} End of group EFM32TG110F32_Alternate_Function */

/**************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 *****************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG)&~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32TG110F32  */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* __EFM32TG110F32_H */
